Autodesk.Revit.DB.AllowedValues
Since:
2014
A range of allowed values.
Since:
2014

Autodesk.Revit.DB.AllowedValues.Positive
Only positive values are allowed. A tolerance of 1.0e-9 is used, so very small positive numbers are rejected.

Autodesk.Revit.DB.AllowedValues.All
All values are allowed.

Autodesk.Revit.DB.AllowedValues.NonNegative
Only non-negative values are allowed. A tolerance of 1.0e-9 is used, so very small negative numbers are accepted.